//自己--类能量走路
function maxAliveYear(birth: number[], death: number[]): number {
  const map = new Map()
  for (const _birth of birth) {
    map.set(_birth, map.has(_birth) ? map.get(_birth) + 1 : 1)
  }
  for (const _death of death) {
    map.set(_death + 1, map.has(_death + 1) ? map.get(_death + 1) - 1 : -1)
  }
  let res = [1900, 0]
  let count = 0
  for (let i = 1900; i <= 2000; i++) {
    if (!map.has(i)) continue
    count += map.get(i)
    if (res[1] < count) {
      res[0] = i
      res[1] = count
    }
  }
  return res[0]
}

maxAliveYear(
  [
    1927,
    1954,
    1903,
    1928,
    1956,
    1929,
    1929,
    1928,
    1958,
    1902,
    1953,
    1912,
    1923,
    1937,
    1915,
    1942,
    1964,
    1954,
    1924,
    1936,
    1963,
    1950,
    1904,
    1931,
    1951,
    1953,
    1922,
    1970,
    1986,
    1947,
    1911,
    1965,
    1913,
    1920,
    1947,
    1962,
    1903,
    1905,
    1978,
    1974,
    1950,
    1921,
    1929,
    1901,
    1925,
    1929,
    1951,
    1944,
    1945
  ],
  [
    1987,
    1992,
    1967,
    1997,
    1963,
    1970,
    1944,
    1986,
    1997,
    1937,
    1971,
    1982,
    1980,
    1992,
    1995,
    1992,
    1991,
    1964,
    1985,
    1938,
    1975,
    1964,
    1975,
    1961,
    1995,
    1985,
    1946,
    1989,
    1999,
    1994,
    1956,
    1984,
    1999,
    1966,
    1950,
    1993,
    1960,
    1939,
    1990,
    1975,
    1982,
    1921,
    1964,
    1998,
    1969,
    1970,
    1965,
    1973,
    1958
  ]
)
